In [7]:
#importation des bibliothèques nécessaires
import pandas as pd
import json
import pyodbc

In [8]:
#affichage du dataset
df = pd.read_csv('insurance.csv')
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [9]:
#fiche technique du dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [10]:
#vérification de l'existence des valeurs manquantes
df.isna().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [11]:
df.duplicated().sum()

1

In [12]:
df.drop_duplicates(inplace = True)

In [13]:
df.duplicated().sum()

0

In [14]:
# Mélanger les lignes pour garantir une répartition aléatoire des données
df = df.sample(frac=1).reset_index(drop=True)

# Calculer le nombre de lignes pour chaque partie en utilisant le pourcentage spécifié

In [15]:
total_rows = len(df)
total_rows

1337

In [16]:
# Pourcentage de données à transférer vers chaque type de fichier
db_json_rows_percentage = 30  
db_rows = int(total_rows * (db_json_rows_percentage / 100))
json_rows = db_rows
csv_rows = total_rows - db_rows - json_rows

In [17]:
json_rows, db_rows, csv_rows

(401, 401, 535)

# Diviser les données en trois parties

In [18]:
json_data = df[:json_rows]
db_data = df[json_rows:json_rows + db_rows]
csv_data = df[json_rows + db_rows:]

In [19]:
json_data

     age     sex     bmi  children smoker     region      charges
0     33    male  42.460         1     no  southeast  11326.71487
1     44    male  34.320         1     no  southeast   7147.47280
2     42    male  26.125         2     no  northeast   7729.64575
3     58    male  34.390         0     no  northwest  11743.93410
4     24  female  20.520         0    yes  northeast  14571.89080
..   ...     ...     ...       ...    ...        ...          ...
396   64    male  37.905         0     no  northwest  14210.53595
397   22  female  24.300         0     no  southwest   2150.46900
398   47    male  29.830         3     no  northwest   9620.33070
399   51  female  33.915         0     no  northeast   9866.30485
400   52  female  18.335         0     no  northwest   9991.03765

[401 rows x 7 columns]

In [20]:
db_data

     age     sex     bmi  children smoker     region      charges
401   25    male  29.700         3    yes  southwest  19933.45800
402   56  female  26.600         1     no  northwest  12044.34200
403   54    male  34.210         2    yes  southeast  44260.74990
404   35  female  35.815         1     no  northwest   5630.45785
405   56    male  36.100         3     no  southwest  12363.54700
..   ...     ...     ...       ...    ...        ...          ...
797   21    male  25.700         4    yes  southwest  17942.10600
798   57  female  25.740         2     no  southeast  12629.16560
799   36    male  34.430         2     no  southeast   5584.30570
800   21    male  23.750         2     no  northwest   3077.09550
801   30    male  25.460         0     no  northeast   3645.08940

[401 rows x 7 columns]

In [21]:
csv_data

      age     sex     bmi  children smoker     region      charges
802    43    male  38.060         2    yes  southeast  42560.43040
803    22    male  25.175         0     no  northwest   2045.68525
804    19  female  24.510         1     no  northwest   2709.11190
805    41  female  33.060         2     no  northwest   7749.15640
806    18  female  35.625         0     no  northeast   2211.13075
...   ...     ...     ...       ...    ...        ...          ...
1332   19    male  26.030         1    yes  northwest  16450.89470
1333   41  female  37.100         2     no  southwest   7371.77200
1334   39  female  31.920         2     no  northwest   7209.49180
1335   27    male  32.670         0     no  southeast   2497.03830
1336   61    male  36.300         1    yes  southwest  47403.88000

[535 rows x 7 columns]

# Sauvegarder les données au format CSV (en excluant l'en-tête)

In [22]:
csv_data.to_csv('insurance_split_csv.csv', index=False)

# Sauvegarder les données au format JSON

In [23]:
json_data.to_json('insurance_split.json', orient='records', lines=True)

In [24]:
json_data = []

with open('insurance_split.json', "r") as json_file:
    # Read the JSON data from the file
    for line in json_file:
        json_object = json.loads(line)
        json_data.append(json_object)

json_data[:5]

[{'age': 33,
  'sex': 'male',
  'bmi': 42.46,
  'children': 1,
  'smoker': 'no',
  'region': 'southeast',
  'charges': 11326.71487},
 {'age': 44,
  'sex': 'male',
  'bmi': 34.32,
  'children': 1,
  'smoker': 'no',
  'region': 'southeast',
  'charges': 7147.4728},
 {'age': 42,
  'sex': 'male',
  'bmi': 26.125,
  'children': 2,
  'smoker': 'no',
  'region': 'northeast',
  'charges': 7729.64575},
 {'age': 58,
  'sex': 'male',
  'bmi': 34.39,
  'children': 0,
  'smoker': 'no',
  'region': 'northwest',
  'charges': 11743.9341},
 {'age': 24,
  'sex': 'female',
  'bmi': 20.52,
  'children': 0,
  'smoker': 'yes',
  'region': 'northeast',
  'charges': 14571.8908}]

# Sauvegarder les données à une base de données relationnelle

In [25]:
df.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [28]:
driver = 'SQL Server'
server = 'LAPTOP-EEA5QPRQ\SQLEXPRESS'
database = 'DataSplitter'

# Établir une connexion au serveur SQL Server sans base de données spécifique
conn = pyodbc.connect(f'''
                        DRIVER={driver};
                        SERVER={server};
                        DATABASE={database};
                        Trusted_Connection=yes
                       ''')
# Créer un curseur pour exécuter les requêtes
cursor = conn.cursor()

In [33]:
#créer la table Insurance
cursor.execute( 
    ''' 
      CREATE TABLE Insurance (
        age INT,
        sex VARCHAR(255),
        bmi FLOAT,
        children INT,
        smoker VARCHAR(255),
        region VARCHAR(255),
        charges FLOAT
        )
    '''
              )      
print('La table Insurance a été créée avec succès')

La table Insurance a été créée avec succès

In [38]:
# Parcourir chaque ligne de la dataframe "db_data"
for index, row in db_data.iterrows():
    age = row['age']
    sex = row['sex']
    bmi = row['bmi']
    children = row['children']
    smoker = row['smoker']
    region = row['region']
    charges = row['charges']
    
    # Exécuter une requête INSERT pour insérer les valeurs dans la table "Insurance"
    #cursor.execute(f"INSERT INTO Insurance (age, sex, bmi, children, smoker, region, charges) VALUES ({age}, {sex}, {bmi}, {children}, {smoker}, {region}, {charges})")
    cursor.execute("""
        INSERT INTO Insurance (age, sex, bmi, children, smoker, region, charges)
        VALUES (?, ?, ?, ?, ?, ?,?)
    """, age, sex, bmi, children, smoker, region, charges)
print('La table Insurance a été insérée avec succès')

La table Insurance a été insérée avec succès

In [39]:
# Validez les modifications et fermez la connexion
conn.commit()
conn.close()